# -*- coding: utf-8 -*-
#TODO: לראות מה לגביי אופק מודרני לעומת מה שפה

#TODO: להוסיף הוית לבנה (13) ומחנה. אולי נצטרך להתחשב בזמני מולד. עיין ספר הקנה ופרדס רימונים.

ET = ["ללדת", "לטעת", "להרוג", "לפרוץ", "להשליך", "לאבד", "לחבק", "לשמור", "לחשות", "לתפור", "מלחמה", "לשנוא", "ספוד",
      "לבכות", "למות", "לעקור נטוע", "לרפוא", "לבנות", "לכנוס", "לבקש", "לרחוק מחבק", "להשליך", "לדבר", "לקרוע", "שלום",
      "לאהוב", "רקוד", "לשחוק", "-", "-"]

CAMP = ["יאהויב", "הויגהו", "ייהוית", "הויצהו", "יקהויר", "הויעהו", "ישהויט", "הוינהו", "ינהויג", "הוידהו", "ייהויכ",
        "הוישהו", "יבהויט", "הוירהו", "יצהוית", "הויגהו", "יחהויק", "הויבהו", "יטהוינ", "הויעהו", "ייהויג", "הוילהו",
        "יפהויז", "הויקהו", "ישהויק", "הויוהו", "יצהויי", "הויתהו", "-", "-"]

# רשימת הכוכבים לפי סדר גמרא (במטריצה 7X24)
PLANETS = ["שבתאי", "צדק", "מאדים", "חמה", "נוגה", "כוכב", "לבנה"]

# מזל משרת עבור הכוכב הנוכחי
DAY_SERVANTS = ["דלי", "קשת", "טלה", "אריה", "מאזניים", "תאומים", "סרטן"]
NIGHT_SERVANTS = ["גדי", "דגים", "עקרב", "אריה", "שור", "בתולה", "סרטן"]

# צירופי אותיות קדושים
H_NAMES = ["יִהַוְהָ", "יִהַהַוְ", "יְווּהַהַ", "הֶוֵהֹיִ", "הַווּיִהַ", "הוּהִוָיִ", "וַהֹיָהַ", "ווּהַהַיְ", "וַיֹהָהַ", "הַיִהוּוְ", "הָיְוְהוּ", "הִהְיְוַ"]
H_NAMES_CLEANED = ["יהוה", "יההו", "יוהה", "הוהי", "הויה", "ההוי", "והיה", "וההי", "ויהה", "היהו", "היוה", "ההיו"]

# TODO: לבדוק למה הרב שקד שינה מהסדר (הנוכחי) המופיע בכתם פז
A_NAMES = ["אדני", "אדינ", "אנדי", "אניד", "דניא", "דנאי", "דיאנ", "דינא", "דאינ", "דאני", "ניאד", "נידא", "נאדי",
           "נאיד", "נדיא", "נדאי", "יאדנ", "יאנד", "ידנא", "ידאנ", "ינאד", "ינדא"]

TRIBES = ["ראובן", "שמעון", "לוי", "יהודה", "יששכר", "זבולון", "דן", "נפתלי", "גד", "אשר", "יוסף", "בנימין"]

# שיטת המיוחס לראב"ד
TRIBES_R = ["ראובן", "שמעון", "לוי", "יהודה", "יששכר", "זבולון", "בנימין", "דן", "נפתלי", "גד", "אשר", "יוסף"]

ABILITIES = ["שיחה", "הרהור", "הילוך", "ראיה", "שמיעה", "מעשה", "ריח", "שינה", "רוגז", "לעיטה", "שחוק", "תשמיש"]

# TODO: להוסיף מימוש
BODY_RULERS = ["רגל ימין", "כליה ימנית", "רגל שמאל", "יד ימין", "כליה שמאלית", "יד שמאל", "מרה", "דקים", "קיבה", "כבד",
               "קורקבן", "טחול"]

STONES = ["אודם", "פטדה", "ברקת", "נופך", "ספיר", "יהלום", "לשם", "שבו", "אחלמה", "תרשיש", "שוהם", "ישפה"]

HOUSES = ["חיים", "ממון", "אחים", "אבות", "בנים", "חולי", "נשים", "מיתה", "דרכים", "מלכות", "אהבה", "איבה"]

DIAGONAL_BOUNDARIES = ["מזרחית רומית", "מזרחית צפונית", "מזרחית תחתית", "דרומית רומית",
                       "דרומית מזרחית", "דרומית תחתית", "מערבית רומית", "מערבית דרומית",
                       "מערבית תחתית", "צפונית רומית", "צפונית מערבית", "צפונית תחתית"]

# צירופי הניקודים
NIKUDIM = ['ֹ', 'ָ', 'ֵ', 'ִ', 'ֻ', 'ְ']

# מילון גימטריאות
GIMATRIA = {
    "י": 10, "ה": 5, "ו": 6, "א": 1,
    'ֹ': 0, 'ָ': 0, 'ֵ': 0, 'ִ': 0, 'ֻ': 0, 'ְ': 0
}

# The following is a dictionary of Hebrew month names
HEBREW_MONTHS = {
    1: "ניסן", 2: "אייר", 3: "סיון", 4: "תמוז", 5: "אב", 6: "אלול",
    7: "תשרי", 8: "חשוון", 9: "כסלו", 10: "טבת", 11: "שבט", 12: "אדר א", 13: "אדר ב"
}

# The following is a dictionary of Hebrew letter values for units, tens, and hundreds
HEBREW_GIMATRIA_MAP = {
    1: "א", 2: "ב", 3: "ג", 4: "ד", 5: "ה", 6: "ו", 7: "ז", 8: "ח", 9: "ט",
    10: "י", 20: "כ", 30: "ל", 40: "מ", 50: "נ", 60: "ס", 70: "ע", 80: "פ", 90: "צ",
    100: "ק", 200: "ר", 300: "ש", 400: "ת"
}

# A dictionary mapping Hebrew month numbers to their corresponding zodiac signs
HEBREW_ZODIAC = {
    1: "טלה", 2: "שור", 3: "תאומים", 4: "סרטן", 5: "אריה", 6: "בתולה",
    7: "מאזניים", 8: "עקרב", 9: "קשת", 10: "גדי", 11: "דלי", 12: "דגים", 13: "דגים"
}

# A list of the 10 Sefirot
SEFIROT = ["חכמה", "בינה", "דעת", "חסד", "גבורה", "תפארת", "נצח", "הוד", "יסוד", "מלכות"]

# The 6 Sefirot that correspond to the months
SEFIROT_MONTH = ["חסד", "גבורה", "תפארת", "נצח", "הוד", "יסוד"]

# The 4 "Faces of the Week"
PARZUF_HASHAVUA = ["אבא", "אמא", "זעיר אנפין", "נוקבא דז\"א"]

# The 7 Sefirot of the Day
SEFIROT_DAY = ["חסד", "גבורה", "תפארת", "נצח", "הוד", "יסוד", "מלכות"]

# A dictionary to map the numerical weekday to the Hebrew name
HEBREW_WEEKDAYS = {
    0: "ראשון", 1: "שני", 2: "שלישי", 3: "רביעי",
    4: "חמישי", 5: "שישי", 6: "שבת"
}

FIRST_DAY_STARS = [3, 6, 2, 5, 1, 4, 0]

FIRST_NIGHT_STARS = [5, 1, 4, 0, 3, 6, 2]

T = 31524 / 25920

C = 765433 / 25920


